# Assignment (Pandas Advance)

### Q1. List any five functions of the pandas library with execution.

1) read_csv()
2) describe()
3) iloc[:]
4) loc[:]
5) head()

In [2]:
import pandas as pd
df=pd.read_csv('Data.csv')
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [3]:
df.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [4]:
df.iloc[0:3,:]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No

In [5]:
df.loc[0:2,['Country','Age']]

   Country   Age
0   France  44.0
1    Spain  27.0
2  Germany  30.0

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
data=[[1,2,3],[1,2,3],[1,2,3]]
i1=[1,3,5]
df=pd.DataFrame(data,columns=['A','B','C'],index=i1)
df

   A  B  C
1  1  2  3
3  1  2  3
5  1  2  3

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [7]:
data=[10,20,30,40,50]
df=pd.DataFrame(data,columns=["Values"])
df

   Values
0      10
1      20
2      30
3      40
4      50

In [8]:
sum(df['Values'][0:3])

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [9]:
#method 1
data=["dimpal","neha","ram","sam","ret"]
df=pd.DataFrame(data,columns=['Text'])
df['Word_count']=df['Text'].str.len()
df

     Text  Word_count
0  dimpal           6
1    neha           4
2     ram           3
3     sam           3
4     ret           3

In [10]:
#method 2
data=["dimpal","neha","ram","sam","ret"]
df1=pd.DataFrame(data,columns=['Text'])
def word_count(df):
    df1['Word_Count'] = df1['Text'].apply(lambda x: len(str(x)))
    return df1
df_add_word=word_count(df1)
print(df_add_word)

     Text  Word_Count
0  dimpal           6
1    neha           4
2     ram           3
3     sam           3
4     ret           3

### Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() returns the total number of elements in DataFrame which is equal to product of no. of rows and no. of columns whereas
DataFrame.shape() returns the tuple with number of rows and columns.

In [11]:
print(df.size)
print(df.shape)

10
(5, 2)

### Q6. Which function of pandas do we use to read an excel file?

read_excel id used to read excel file in pandas.

In [68]:
df1=pd.read_excel('Historicalinvesttemp.xlsx')
df1

   Unnamed: 0                        Unnamed: 1 Unnamed: 2 Unnamed: 3
0         NaN                               NaN        NaN        NaN
1         NaN                               NaN        NaN        NaN
2         NaN                               NaN        NaN        NaN
3         NaN                               NaN        NaN        NaN
4         NaN  Annual Returns on Investments in        NaN        NaN
..        ...                               ...        ...        ...
85       2007                            0.0549     0.0988     0.0466
86       2008                             -0.37     0.2587      0.016
87       2009                            0.2646     -0.149      0.001
88        NaN                            stocks     tbills      bonds
89   averages                               NaN        NaN        NaN

[90 rows x 4 columns]

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [ ]:
data=['dimpal@gmail.com','admin123@gmail.com','user@yahoo.com','xyz@gmail.com']
df = pd.DataFrame(data,columns=['Email'])
df['Username']=df['Email'].str.split("@").str[0]
df

In [ ]:
#method 2
data=['dimpal@gmail.com','admin123@gmail.com','user@yahoo.com','xyz@gmail.com']
df1 = pd.DataFrame(data,columns=['Email'])
def username(df1):
    df1['Username']=df1['Email'].str.split("@").str[0]
    return df1
add_username=username(df1)
print(add_username)

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [13]:
data=[[3,5,1],[8,2,7],[6,9,4],[2,3,5],[9,1,2]]
df=pd.DataFrame(data,columns=['A','B','C'])
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [14]:
df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [15]:
data=[10,20,30,40,50]
df=pd.DataFrame(data,columns=["Values"])
print('Mean :',df.mean())
print('Median :',df.median())
print('Standard Deviation :',df.std())

Mean : Values    30.0
dtype: float64
Median : Values    30.0
dtype: float64
Standard Deviation : Values    15.811388
dtype: float64

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [45]:
df4=pd.DataFrame({'Sales':[100,200,300,200,240,430,123,342,876,456,789,244,543,124,543],'Date':['2022-05-29', '2022-05-30', '2022-05-31', '2022-06-01',
               '2022-06-02', '2022-06-03', '2022-06-04', '2022-06-05',
               '2022-06-06', '2022-06-07', '2022-06-08', '2022-06-09',
               '2022-06-10', '2022-06-11', '2022-06-12']})

In [46]:
df4['MovingAverage']=df4.rolling(window=7).mean()

C:\Users\patel\AppData\Local\Temp\ipykernel_38552\1421736992.py:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  df4['MovingAverage']=df4.rolling(window=7).mean()

In [47]:
df4

    Sales        Date  MovingAverage
0     100  2022-05-29            NaN
1     200  2022-05-30            NaN
2     300  2022-05-31            NaN
3     200  2022-06-01            NaN
4     240  2022-06-02            NaN
5     430  2022-06-03            NaN
6     123  2022-06-04     227.571429
7     342  2022-06-05     262.142857
8     876  2022-06-06     358.714286
9     456  2022-06-07     381.000000
10    789  2022-06-08     465.142857
11    244  2022-06-09     465.714286
12    543  2022-06-10     481.857143
13    124  2022-06-11     482.000000
14    543  2022-06-12     510.714286

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values: Date 0 2023-01-01 1 2023-01-02 2 2023-01-03 3 2023-01-04 4 2023-01-05

In [53]:
df6=pd.DataFrame({'date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})

In [62]:
df6['update_date']=pd.to_datetime(df6['date'])

In [64]:
df6['weekday']=df6['update_date'].dt.day_name()

In [65]:
df6[['update_date','weekday']]

  update_date    weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [80]:
df7 = pd.DataFrame(data=['2023-01-05 09:15:00','2023-03-02 15:25:02','2023-03-02 15:45:00','2023-01-02 05:55:00','2023-03-02 05:55:00'],columns=['Date'])
df7['Date'] = pd.to_datetime(df7['Date'])
df7['Date'].dt.date

0    2023-01-05
1    2023-03-02
2    2023-03-02
3    2023-01-02
4    2023-03-02
Name: Date, dtype: object

In [81]:
start_date = '2023-01-01'
end_date = '2023-01-31'

In [82]:
df7

                 Date
0 2023-01-05 09:15:00
1 2023-03-02 15:25:02
2 2023-03-02 15:45:00
3 2023-01-02 05:55:00
4 2023-03-02 05:55:00

In [83]:
df7.loc[(df7['Date']>start_date) & (df7['Date']<end_date)]

                 Date
0 2023-01-05 09:15:00
3 2023-01-02 05:55:00

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

pandas

In [84]:
import pandas as pd